tgi/endliche_automaten.html
---
layout: page
title: Endliche_automaten
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Endliche Automaten</h2>
<div class="outline-text-2" id="text-1">
<p>
Ein Automatenmodell heißt <i>endlich</i> genau dann, wenn die Menge der
Zustände des Automaten endlich ist. Man unterscheidet:
</p>

<ul class="org-ul">
<li><i>DFA</i>
</li>
<li><i>NFA</i>
</li>
<li><i>GNFA</i>
</li>
<li><i>PDA</i>
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Äquivalenz von Automaten</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Automaten \(M_0, M_1\) sind äquivalent, falls \(L(M_0) = L(M_1)\).
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Verfahren zur Konstruktion äquivalenter Automaten</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Sei \(M\) &#x2026;
</p>

<ul class="org-ul">
<li>ein NFA. Dann erhält man durch <i>Potenzmengenkonstruktion</i> einen
äquivalenten DFA
</li>
<li></li>
</ul>
</div>
</div>
</div>
